app/controllers/messages_controller.rb

  def index
    @messages = Message.all
---
SELECT "messages".* FROM "messages"

  def create
    @message = Message.new(message_params)

    respond_to do |format|
      if @message.save
---
INSERT INTO "messages" ("name", "email", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Test"], ["email", "Test"], ["description", "Test description"], ["created_at", "2023-07-29 13:45:12.212580"], ["updated_at", "2023-07-29 13:45:12.212580"]]